In [3]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

# Series 是一种类似一维数组的对象，仅由一组数据即可产生最简单的Series

In [5]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [15]:
obj.index.values

array([0, 1, 2, 3], dtype=int64)

In [12]:
obj2 = Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2['a']

-5

In [17]:
obj2['d']=6

In [19]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [20]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [21]:
obj2**2

d    36
b    49
a    25
c     9
dtype: int64

In [23]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [24]:
'b' in  obj2

True

In [25]:
'e' in obj2

False

In [28]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
# 如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）
states = ['California','Ohio','Oregon','Texas']
obj4 = Series(sdata,index=states)
# NaN，即非数字，表示缺失或NA值
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
# pandas的isnull和notnull函数可用来检测缺失数据
pd.isnull(obj4)  # 是否为缺失
obj4.isnull()    # 是否为缺失

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
pd.notnull(obj4)  # 是否不为缺失
obj4.notnull()    # 是否不为缺失

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [34]:
# Series：在算术运算中会自动对齐不同索引的数据
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [35]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4.index.name = 'state'

In [39]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [40]:
# Series的索引可以通过赋值的方式就地修改
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame
## DataFrame是一个表格型的数据结构，它包含一组有序的列，每列可以是不同的值类型（数值、字符串、布尔值等）
## DataFrame既有行索引，又有列索引

In [16]:
# 最常用的一种是直接传入一个由等长列表或Numpy数据组成的字典
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [17]:
# 也可以按指定顺序进行排列
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [18]:
# 如果传入的列在数据中找不到，就会产生NA值
frame2 = DataFrame(data,columns=['year','state','pop','debt'],
                  index = ['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [19]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
# 通过类似字典标记的方式或属性的方式，获取某一列数据
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [21]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [22]:
# 行也可以通过位置和名称的方式进行获取，比如用索引ix
frame2.ix['three']

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [23]:
# 列可以通过赋值的方式进行修改
frame2['debt']=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [24]:
# 将列表或数组赋值给某列时，其长度必须和DataFrame的长度想匹配
frame2['debt']=np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [25]:
# 如果赋值的是一个Series,就会精确匹配DataFrame的索引，所有的空位都将被填上缺失值
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [26]:
# 为不存在的列赋值会创建一个新的列
frame2['eastern'] = frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [27]:
# 关键字del 用于删除列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [4]:
# 另一种常见的数据形式是嵌套字典
pop ={'Nevada':{2001:2.4,2002:2.9},
     'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
# 将它传递给DataFrame，外层字典的键作为列，内层键作为行索引
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [5]:
frame3.T  # 转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [6]:
# 内层字典的键会被合并、排序以形成最终的索引.如果显式指定了索引，则不会这样
DataFrame(pop,index=Series([2001,2002,2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [8]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [12]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [13]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [28]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

# 索引对象

In [34]:
obj = Series(range(3),index=Series(['a','b','c']))
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [35]:
index[1:]

Index(['b', 'c'], dtype='object')

In [36]:
# index对象是不可修改的，因此用户不能对其进行修改
# 下面这句话会报错
index[1] = 'd'

TypeError: Index does not support mutable operations

In [38]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5,-2.5,0],index=index)

In [42]:
obj2.index is index

True

In [41]:
index

Int64Index([0, 1, 2], dtype='int64')

In [43]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [44]:
'Ohio' in frame3.columns

True

In [45]:
2003 in frame3.index

False

# 基本功能

## 重新索引 reindex(),创建一个适应新索引的新对象

In [46]:
obj =  Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [47]:
# 调用Series的reindex将会genuine新索引进行重新排序。如果某个索引值当前不存在，就引入缺失值
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [48]:
obj.reindex(['a','b','c','d','e'],fill_value=0)  # fill_value 将缺失值填充为0

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [49]:
# 对时间序列的有序数据，重新索引时需要做一些插值处理。
# method选项可以达到此目的，例如，使用ffill可以实现前向值填充,bfill后向填充
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [50]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [51]:
# reindex可以修改行索引和列索引，如果仅传入一个序列，则会修改索引行
frame = DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [53]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [55]:
# 使用columns关键字即可重新索引列
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [62]:
#对行和列进行重新索引你，而插值则只能按行应用（即轴0）
frame.reindex(index=['a','b','c','d'],columns=states).ffill()

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [63]:
# ix标签索引功能
frame.ix[['a','b','c','d'],states]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [65]:
# 丢弃指定轴上的项
obj = Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [66]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [68]:
# 对DataFrame可以删除任意轴上的索引值
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [70]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

##  索引  选取 和 过滤

In [72]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [73]:
obj['b']

1.0

In [74]:
obj[1]

1.0

In [75]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [76]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [77]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [78]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [79]:
# 利用标签的切片运算与python普通切片运算不同，其末端是包含的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [81]:
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [82]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [83]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [84]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [85]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [86]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [89]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data.ix['Colorado',['two','three']]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [93]:
data.ix[['Colorado','Utah'],[3,0,1]]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [94]:
data.ix[2]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [95]:
data.ix[:'Utah','two']

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [96]:
data.ix[data.three>5,:3]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## 算术运算和数据对齐

In [99]:
# 可以对不同索引的对象进行算术运算
# 在将对象相加时，如果存在不同的索引对，则结果的索引就是该索引对的并集
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1+s2  # 不重叠的索引处会出现NA值

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [103]:
df1 = DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [104]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [106]:
## 在算术方法中填充值
df1 = DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [107]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [108]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [109]:
# add:加 sub :减 div：除  mul:乘
df1.add(df2,fill_value=0) # 先将没有重叠的值填充为0，再进行运算

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [110]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## DataFrame与Series之间的运算

In [111]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [112]:
arr[0]

array([0., 1., 2., 3.])

In [113]:
arr-arr[0]  # 计算二维数组与其某行之间的差

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [114]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texass','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texass  6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
series = frame.ix[0]
series

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [117]:
# 默认情况下，DataFrame 和Series之间的算术运算会将Series的索引匹配到DataFrame的列，然后沿着行一直向下广播
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texass  6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [119]:
series2 = Series(range(3),index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [120]:
# 如果某个索引值在DataFrame或Series上找不到，则参与运算的两个对象就会被重新索引以形成并集
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texass  6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [122]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texass     7.0
Oregon    10.0
Name: d, dtype: float64

In [123]:
# 如果希望匹配行且在列上广播，则必须使用算术运算方法
frame.sub(series3,axis=0)  # axis是希望匹配的轴，匹配DataFrame的行索引并进行广播

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texass -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## 函数应用和映射

In [124]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    0.098192 -0.123673 -1.709654
Ohio    0.242865 -3.353166  1.216057
Texas  -0.012811  1.385923  0.852266
Oregon  0.104980 -1.103985  0.416332

In [125]:
np.abs(frame)

               b         d         e
Utah    0.098192  0.123673  1.709654
Ohio    0.242865  3.353166  1.216057
Texas   0.012811  1.385923  0.852266
Oregon  0.104980  1.103985  0.416332

In [126]:
# 将函数应用到由各列或行所形成的一维数组上
f = lambda x: x.max()-x.min()
frame.apply(f)

b    0.255675
d    4.739089
e    2.925711
dtype: float64

In [127]:
frame.apply(f,axis=1)

Utah      1.807846
Ohio      4.569223
Texas     1.398734
Oregon    1.520317
dtype: float64

In [131]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b         d         e
min -0.012811 -3.353166 -1.709654
max  0.242865  1.385923  1.216057

In [132]:
# 元素级的python函数也是可以的
format = lambda x: '%.2f' %x
frame.applymap(format)

            b      d      e
Utah     0.10  -0.12  -1.71
Ohio     0.24  -3.35   1.22
Texas   -0.01   1.39   0.85
Oregon   0.10  -1.10   0.42

In [134]:
# series有一个用于元素级函数的map方法
frame['e'].map(format)

Utah      -1.71
Ohio       1.22
Texas      0.85
Oregon     0.42
Name: e, dtype: object

## 排序和排名

In [135]:
# 要对行或列索引进行排序（按字典顺序），可用sort_index方法，它将返回一个已排序的新对象
obj = Series(range(4),index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [136]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [137]:
# DataFrame根据一个轴上的索引进行排序
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [138]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [139]:
frame.sort_index(axis=1)  # 按列排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [140]:
# 数据默认是按升序排序，但是也可以选择降序排序
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [141]:
# 若要按值对Series进行排序，可用order()
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [143]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [144]:
# 在排序时，任何缺失值都会默认放到Series的末尾
obj = Series([4,np.nan,7,np.nan,-3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [145]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [146]:
# DataFrame中按一个或多个列中的值进行排序，把对应的列名传递给by选项即可
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [147]:
frame.sort_index(by=['a','b'])

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [149]:
# 排名：会增加一个排名值，从1开始
# 默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系的
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [150]:
# 也可以根据值在原始数据中出现的顺序给出排名
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [151]:
# 也可以按降序进行排名
obj.rank(ascending=False,method='max')  # method='max':使用整个分组的最大排名

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [152]:
# DataFrame可以在行或列删计算排名
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [153]:
frame.rank(axis=1)  # 按列排序

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## 带有重复值的轴索引

In [154]:
obj = Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [155]:
# 索引的is_unique属性判断索引值是否唯一
obj.index.is_unique

False

In [156]:
obj['a']  # 如果某个索引对应多个指，则返回一个Series

a    0
a    1
dtype: int64

In [157]:
obj['c']  # 如果某个索引对应一个值，则返回一个标量值

4

In [158]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])
df

          0         1         2
a -0.568177  0.267612  0.665095
a -0.242296 -0.014472 -0.589917
b -0.125635  0.351389 -0.774705
b -0.100661  0.644367  0.801917

In [159]:
df.ix['b']

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.125635  0.351389 -0.774705
b -0.100661  0.644367  0.801917

## 汇总和计算描述统计

In [160]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [161]:
# 如果存在NA值，会自动被排除，可以通过skipna选项禁用该功能,默认为true 
df.sum()

one    9.25
two   -5.80
dtype: float64

In [162]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [163]:
# idxmin 和 idxmax间接统计达到最小值和最大值的索引
df.idxmin()

one    d
two    b
dtype: object

In [164]:
df.idxmax()

one    b
two    d
dtype: object

In [165]:
# 累计求和
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [166]:
# describe用于一次性产生多个汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [167]:
# 对于非数值型数据，describe会产生另一种汇总统计
obj = Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [168]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 相关系数和协方差

In [183]:
import pandas_datareader.data as web  # Yahoo!Finance导入股票价格和成交量
import datetime

In [184]:
all_data = {}
start = datetime.datetime(2000,1,1)  
end = datetime.datetime(2010,1,1)  
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,start,end)  # '1/1/2000','1/1/2010'
  
price = DataFrame({tic:data['Adj Close'] for tic,data in all_data.items()})  # 股票价格
volume = DataFrame({tic:data['Volume'] for tic,data in all_data.items()})    # 成交量

In [192]:
# 计算价格的百分数变化
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034340  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011862 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004299 -0.012597 -0.015504 -0.004416

In [199]:
volume.tail()

                   AAPL        IBM        MSFT       GOOG
Date
2009-12-24  125222300.0  4265100.0  11083900.0  1723800.0
2009-12-28  161141400.0  5800400.0  25384000.0  3408400.0
2009-12-29  111301400.0  4184200.0  29716200.0  2860200.0
2009-12-30  103021100.0  3867000.0  42006200.0  2942100.0
2009-12-31   88102700.0  4223400.0  31929700.0  2448700.0

In [193]:
# Series的corr计算两个Series 中重叠的、非NA的、按索引对齐的值的相关系数
# cov用于计算协方差
returns.MSFT.corr(returns.IBM)  # 计算MSFT与IBM之间的相关系数

0.49435831782746215

In [194]:
returns.MSFT.cov(returns.IBM)  # 计算MSFT与IBM之间的协方差

0.00021582135405603418

In [195]:
# DataFrame的corr和cov方法将以DataFrame的形式返回完整的相关系数或协方差矩阵
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.412392  0.423598  0.470676
IBM   0.412392  1.000000  0.494358  0.390689
MSFT  0.423598  0.494358  1.000000  0.443586
GOOG  0.470676  0.390689  0.443586  1.000000

In [197]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001030  0.000254  0.000309  0.000303
IBM   0.000254  0.000369  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

In [198]:
# DataFrame的corrwith计算某一列或行与另一个Series或DataFrame之间的相关系数
returns.corrwith(returns.IBM)

AAPL    0.412392
IBM     1.000000
MSFT    0.494358
GOOG    0.390689
dtype: float64

In [200]:
# 传入一个DataFrame则会结算按列名配对的相关系数
# 计算百分比变化与成交量的相关系数,传入aixs=1按行进行计算
returns.corrwith(volume)

AAPL   -0.057664
IBM    -0.006592
MSFT   -0.014228
GOOG    0.062647
dtype: float64

## 唯一值、值计数及成员资格

In [201]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()  # 返回唯一值，未排序
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [203]:
uniques.sort()   # 返回唯一值，并进行排序
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [204]:
# value_counts用于计算一个Series中各值出现的频率
obj.value_counts() # 是按值的频率降序排列的

a    3
c    3
b    2
d    1
dtype: int64

In [205]:
pd.value_counts(obj.values,sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [207]:
# isin用于判断矢量化集合的成员资格
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [208]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [209]:
data = DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [210]:
# 将pandas.value_counts传给DataFrame的apply函数
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 处理缺失值

In [211]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [212]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [213]:
# python 内置的None也会被当做NA处理
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [214]:
string_data.fillna('0',inplace=True)  # 对缺失值进行填充，可以用ffill 或 bfill进行前向或后向填充
string_data

0            0
1    artichoke
2            0
3      avocado
dtype: object

In [215]:
## 过滤缺失数据
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [216]:
# 过滤掉缺失值，对于Series,dropna返回一个仅含有非空数据和索引的Series
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [218]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [219]:
# dropna默认丢弃任何含有缺失值的行
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [220]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [221]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [222]:
data.dropna(how='all')  #只丢弃全为NA的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [223]:
# 如果要丢弃列，axis=1
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [224]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [225]:
df = DataFrame(np.random.randn(7,3))
df.ix[:4,1]=NA    # ix是包含4的
df.ix[:2,2]=NA
df

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

          0         1         2
0  1.961132       NaN       NaN
1 -2.277256       NaN       NaN
2  0.679266       NaN       NaN
3 -1.794557       NaN -0.596908
4 -0.660527       NaN  0.773087
5 -0.801103  1.233187  0.288194
6 -1.021933  0.097484  1.782846

In [226]:
# thresh=3表示这一行除去NA值，剩余数值的数量大于等于3，就显示这一行
df.dropna(thresh=3)

          0         1         2
5 -0.801103  1.233187  0.288194
6 -1.021933  0.097484  1.782846

In [227]:
## 填充缺失值
df.fillna(0)

          0         1         2
0  1.961132  0.000000  0.000000
1 -2.277256  0.000000  0.000000
2  0.679266  0.000000  0.000000
3 -1.794557  0.000000 -0.596908
4 -0.660527  0.000000  0.773087
5 -0.801103  1.233187  0.288194
6 -1.021933  0.097484  1.782846

In [228]:
df.fillna({1:0.5,3:-1})  # 第一列NA值填充为0.5  第3列NA值填充为-1

          0         1         2
0  1.961132  0.500000       NaN
1 -2.277256  0.500000       NaN
2  0.679266  0.500000       NaN
3 -1.794557  0.500000 -0.596908
4 -0.660527  0.500000  0.773087
5 -0.801103  1.233187  0.288194
6 -1.021933  0.097484  1.782846

In [229]:
# fillna默认会返回新对象，但也可以对现有对象进行修改
_ = df.fillna(0,inplace=True)
df

          0         1         2
0  1.961132  0.000000  0.000000
1 -2.277256  0.000000  0.000000
2  0.679266  0.000000  0.000000
3 -1.794557  0.000000 -0.596908
4 -0.660527  0.000000  0.773087
5 -0.801103  1.233187  0.288194
6 -1.021933  0.097484  1.782846

In [230]:
df = DataFrame(np.random.randn(6,3))
df.ix[2:,1]=NA
df.ix[4:,2]=NA
df

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

          0         1         2
0  0.634974 -1.102206 -0.390704
1  0.814386  0.239451  1.243484
2 -1.068874       NaN  0.368968
3 -0.630163       NaN -1.392199
4  0.676341       NaN       NaN
5 -0.178169       NaN       NaN

In [231]:
df.fillna(method='ffill')

          0         1         2
0  0.634974 -1.102206 -0.390704
1  0.814386  0.239451  1.243484
2 -1.068874  0.239451  0.368968
3 -0.630163  0.239451 -1.392199
4  0.676341  0.239451 -1.392199
5 -0.178169  0.239451 -1.392199

In [232]:
df.fillna(method='bfill')

          0         1         2
0  0.634974 -1.102206 -0.390704
1  0.814386  0.239451  1.243484
2 -1.068874       NaN  0.368968
3 -0.630163       NaN -1.392199
4  0.676341       NaN       NaN
5 -0.178169       NaN       NaN

In [233]:
df.fillna(method='ffill',limit=2)  # limit 可以连续填充的最大数量

          0         1         2
0  0.634974 -1.102206 -0.390704
1  0.814386  0.239451  1.243484
2 -1.068874  0.239451  0.368968
3 -0.630163  0.239451 -1.392199
4  0.676341       NaN -1.392199
5 -0.178169       NaN -1.392199

In [237]:
data = Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [238]:
data.fillna(data.mean()) # 用均值填充缺失值

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 层次化索引

In [240]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data

a  1   -1.822869
   2    0.192181
   3   -0.978074
b  1   -0.538173
   2    1.063345
   3    1.251835
c  1    0.608170
   2    2.068298
d  2    0.289969
   3   -0.320974
dtype: float64

In [241]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [242]:
data['b']

1   -0.538173
2    1.063345
3    1.251835
dtype: float64

In [243]:
data['b':'c']

b  1   -0.538173
   2    1.063345
   3    1.251835
c  1    0.608170
   2    2.068298
dtype: float64

In [244]:
data.ix[['b','c']]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -0.538173
   2    1.063345
   3    1.251835
c  1    0.608170
   2    2.068298
dtype: float64

In [245]:
# 在内层中进行选取
data[:,2]

a    0.192181
b    1.063345
c    2.068298
d    0.289969
dtype: float64

In [247]:
# unstack()方法将数据重新安排到一个DataFrame中
data.unstack()

          1         2         3
a -1.822869  0.192181 -0.978074
b -0.538173  1.063345  1.251835
c  0.608170  2.068298       NaN
d       NaN  0.289969 -0.320974

In [248]:
# unstack逆运算是stack
data.unstack().stack()

a  1   -1.822869
   2    0.192181
   3   -0.978074
b  1   -0.538173
   2    1.063345
   3    1.251835
c  1    0.608170
   2    2.068298
d  2    0.289969
   3   -0.320974
dtype: float64

In [249]:
# 每层轴都可以有分层索引
frame = DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [250]:
frame.index.names=['key1','key2']  # 索引名
frame.columns.names=['state','color']  # 轴标签
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [251]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [252]:
## 重排分级顺序
# swaplevel 接受两个级别编号或名称，并返回一个互换了级别的新对象（但数据不发生变化）
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [254]:
# sortlevel 则根据单个级别中的盒子对数据进行排序
frame.sortlevel(1)  # 按key1进行排序

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [255]:
frame.swaplevel(0,1).sortlevel(0)

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## 根据级别汇总统计

In [256]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [257]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [258]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [259]:
# set_index将其中一个或多个列转换为行索引，并创建一个新的DataFrame
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [260]:
# 默认情况下，那些列会从DataFrame中移除，但也可以保留下来
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [261]:
# reset_index  和 set_index正好相反，层次化索引级别会被转到列里面
frame2.reset_index(['c','d'])

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [264]:
# 整数索引，如果出现ser[-1]会报错，因为引起歧义
ser = Series(np.arange(3.))
ser[-1]

KeyError: -1

In [266]:
# 如果是非整数索引 就不会有歧义
ser2 = Series(np.arange(3.),index=['a','b','c'])
ser2[-1]

2.0

In [267]:
ser.ix[:1]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [270]:
# iat
ser3 = Series(range(3),index=[-5,1,3])
ser3.iat[2]

2

In [286]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])
frame.iloc[0,:]

0    0
1    1
Name: 2, dtype: int32

## 面板数据

In [287]:
all_data = {}
start = datetime.datetime(2009,1,1)  
end = datetime.datetime(2012,6,1)  
for stk in ['AAPL','IBM','MSFT','GOOG']:
    all_data[stk] = web.get_data_yahoo(stk,start,end)  
pdata = pd.Panel(all_data)

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2963: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [288]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 862 (major_axis) x 6 (minor_axis)
Items axis: AAPL to GOOG
Major_axis axis: 2008-12-31 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: High to Adj Close

In [289]:
pdata = pdata.swapaxes('items','minor')
pdata['Adj Close']  # pdata中的每一项都是一个DataFrame

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

                 AAPL         IBM       MSFT        GOOG
Date
2008-12-31  10.583897   59.802261  14.909866  153.250580
2009-01-02  11.253528   62.083233  15.592469  160.060059
2009-01-05  11.728474   61.692394  15.738195  163.412491
2009-01-06  11.535025   63.404896  15.922266  166.406265
2009-01-07  11.285772   62.381657  14.963554  160.403763
2009-01-08  11.495339   61.948238  15.431399  161.987823
2009-01-09  11.232448   60.185989  14.971218  156.946732
2009-01-12  10.994360   60.903641  14.932869  155.761169
2009-01-13  10.876552   60.640755  15.201311  156.573120
2009-01-14  10.581416   59.113007  14.641424  149.923050
2009-01-15  10.339605   59.773846  14.756468  148.936752
2009-01-16  10.209399   60.342285  15.116944  149.275482
2009-01-20   9.697256   58.253212  14.173573  140.847076
2009-01-21  10.271402   64.961075  14.863844  150.974106
2009-01-22  10.957154   64.001785  13.122831  152.677719
2009-01-23  10.957154   63.589630  13.191854  161.743744
2009-01-26  11.115884   65.088966  13.521647  161.330292
2009-01-27  11.251047   65.131607  13.544660  165.121078
2009-01-28  11.681350   67.377037  13.836110  173.683990
2009-01-29  11.532542   65.735603  13.490972  171.018982
2009-01-30  11.176645   65.124512  13.115162  168.632919
2009-02-02  11.347773   64.612877  13.675047  169.649109
2009-02-03  11.530063   66.424858  14.188914  169.589340
2009-02-04  11.600746   65.962990  14.288616  170.859573
2009-02-05  11.961601   65.664551  14.603077  176.199554
2009-02-06  12.365862   68.686646  15.078599  184.946777
2009-02-09  12.711839   69.172462  14.909866  188.677795
2009-02-10  12.131488   66.636192  14.419001  178.585617
2009-02-11  12.006242   67.986504  14.733459  178.351501
2009-02-12  12.310059   67.922188  14.771810  180.847137
...               ...         ...        ...         ...
2012-04-20  71.052872  150.507767  26.844006  296.917084
2012-04-23  70.894127  149.768814  26.595600  297.684204
2012-04-24  69.477982  150.809402  26.429993  299.512360
2012-04-25  75.643555  153.501328  26.661844  303.721588
2012-04-26  75.358330  155.016937  26.587317  306.585846
2012-04-27  74.775505  155.944427  26.479673  306.341766
2012-04-30  72.416931  156.148041  26.512798  301.295685
2012-05-01  72.187500  156.841705  26.504519  301.086456
2012-05-02  72.664940  156.886978  26.330631  302.496185
2012-05-03  72.149063  156.268677  26.297516  304.369141
2012-05-04  70.094284  154.572067  25.651670  297.370392
2012-05-07  70.618835  153.637070  25.378426  302.640625
2012-05-08  70.457634  152.561859  25.254229  305.250854
2012-05-09  70.581635  152.372513  25.469513  303.437653
2012-05-10  70.747803  151.895493  25.452951  305.684235
2012-05-11  70.275345  152.327103  25.800713  301.484955
2012-05-14  69.222549  151.017120  25.403267  300.872253
2012-05-15  68.596275  150.714249  25.178238  304.413971
2012-05-16  67.717102  151.236679  24.919872  313.290710
2012-05-17  65.737991  149.843475  24.769852  310.361694
2012-05-18  65.770210  148.321487  24.394806  299.078979
2012-05-21  69.601997  149.745026  24.794863  305.908386
2012-05-22  69.067520  149.033279  24.803186  299.278229
2012-05-23  70.752777  148.503204  24.261457  303.592072
2012-05-24  70.102989  148.480530  24.228115  300.702881
2012-05-25  69.727234  147.125122  24.219776  294.660553
2012-05-29  70.964836  148.760651  24.636501  296.060303
2012-05-30  71.820480  147.299225  24.453144  293.016693
2012-05-31  71.641876  146.065002  24.328133  289.345459
2012-06-01  69.566040  143.172455  23.711386  284.423920

[862 rows x 4 columns]

In [290]:
# 基于ix的标签呗推广到了三个维度
pdata.ix[:,'6/1/2012',:]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

            High         Low        Open       Close       Volume   Adj Close
AAPL   81.807144   80.074287   81.308571   80.141426  130246900.0   69.566040
IBM   191.720001  188.600006  190.119995  189.080002    5206400.0  143.172455
MSFT   28.959999   28.440001   28.760000   28.450001   56634300.0   23.711386
GOOG  285.255798  283.113831  284.827393  284.423920    6138700.0  284.423920

In [292]:
pdata.ix['Adj Close','5/22/2012'::]

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

                 AAPL         IBM       MSFT        GOOG
Date
2012-05-22  69.067520  149.033279  24.803186  299.278229
2012-05-23  70.752777  148.503204  24.261457  303.592072
2012-05-24  70.102989  148.480530  24.228115  300.702881
2012-05-25  69.727234  147.125122  24.219776  294.660553
2012-05-29  70.964836  148.760651  24.636501  296.060303
2012-05-30  71.820480  147.299225  24.453144  293.016693
2012-05-31  71.641876  146.065002  24.328133  289.345459
2012-06-01  69.566040  143.172455  23.711386  284.423920

In [295]:
stacked  = pdata.ix[:,'5/30/2012':,:].to_frame()
stacked

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\pandas\core\indexing.py:150: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return self.obj._slice(obj, axis=axis, kind=kind)

                        High         Low        Open       Close       Volume  \
Date       minor
2012-05-30 AAPL    82.855713   80.937141   81.314285   82.738571  132357400.0
           IBM    195.470001  193.770004  194.800003  194.529999    3602500.0
           MSFT    29.480000   29.120001   29.350000   29.340000   41585500.0
           GOOG   294.844849  290.675476  292.981842  293.016693    3827600.0
2012-05-31 AAPL    83.071426   81.637146   82.962860   82.532860  122918600.0
           IBM    194.929993  192.000000  194.100006  192.899994    9287500.0
           MSFT    29.420000   28.940001   29.299999   29.190001   39134000.0
           GOOG   293.898407  288.418945  293.260773  289.345459    5958800.0
2012-06-01 AAPL    81.807144   80.074287   81.308571   80.141426  130246900.0
           IBM    191.720001  188.600006  190.119995  189.080002    5206400.0
           MSFT    28.959999   28.440001   28.760000   28.450001   56634300.0
           GOOG   285.255798  283.113831  284.827393  284.423920    6138700.0

                   Adj Close
Date       minor
2012-05-30 AAPL    71.820480
           IBM    147.299225
           MSFT    24.453144
           GOOG   293.016693
2012-05-31 AAPL    71.641876
           IBM    146.065002
           MSFT    24.328133
           GOOG   289.345459
2012-06-01 AAPL    69.566040
           IBM    143.172455
           MSFT    23.711386
           GOOG   284.423920

In [296]:
# to_panel 是 to_frame的逆运算
stacked.to_panel()

D:\Program Files (x86)\Asiainfo\Python\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: High to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to GOOG